extends Node
func Dialog(int_dialogindex):
	match int_dialogindex:
		#айди
			#[текст, скорость ввода 1/0.001c]
			#ИЛИ
			#[текст, скорость ввода 1/0.001c, скорость тряски, сила тряски]
			#ИЛИ
			#[текст, скорость ввода 1/0.001c, [вариант выбора1,вариант выбораn...]]
			#ИЛИ
			#[текст, скорость ввода 1/0.001c, [вариант выбора1,вариант выбораn...], скорость тряски, сила тряски]
			#Hi
		1:
			return ["sas",0.1]
		2:
			return ["SAS",0.1,0.1,100]
		3:
			return ["sas",0.1,["SAAAAAAS1","SAAAAAAS2","SAAAAAAS3"]]
		4:
			return ["sas",0.1,["sas1","sas2"],0.1,100]

